Revit 2027 API
AssetProperty.NumberOfConnectedProperties Property
 The number of currently connected properties.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfConnectedProperties { get; }
Public ReadOnly Property NumberOfConnectedProperties As Integer
	Get
public:
property int NumberOfConnectedProperties {
	int get ();
}
member NumberOfConnectedProperties : int with get
Property Value
Int32
See Also
Reference
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace